In [37]:
import pandas as pd
import numpy

In [38]:
import pymysql
pymysql.install_as_MySQLdb()
db = pymysql.connect(host="localhost",    
                     user="root",        
                     passwd="", 
db="mini") 
cur = db.cursor()

In [39]:
length=1000
user=pd.DataFrame()
book=pd.DataFrame()
rating=pd.DataFrame()

In [40]:
#cur.execute('drop table user')
cur.execute('drop table rating')
#cur.execute('drop table book')

0

In [41]:
import random
a=[]
b=[]
ko=["Male","Female","Others"]
c=[]
op=['Satyajit','Deepa','Anshaj','Shukla','Tyagi','Ron','Harry','Opert']
oo="ABCDEFGHIJKLMNOPQRSTUVWXYZ"
pp="1234567890"
em=[]
nm=[]
pw=[]
un=[]

for i in range(1,length):
    a.append(i)
    un.append('Decy'+str(i))
    b.append(random.choice(ko))
    nm.append(random.choice(op))
    em.append(random.choice(oo)+random.choice(pp)+random.choice(op)+'@'+'gmail.com')
    pw.append('decy'+random.choice(pp)+random.choice(oo)+random.choice(pp)+'#'+'A')
    c.append(numpy.random.randint(11,80))

In [42]:
user['userid']=a
user['uname']=un
user['name']=nm
user['email']=em
user['password']=pw
user['sex']=b
user['age']=c

In [43]:
user.head()

   userid  uname      name               email   password     sex  age
0       1  Decy1  Satyajit  H4Shukla@gmail.com  decy7G7#A  Others   58
1       2  Decy2    Shukla   X1Harry@gmail.com  decy1N1#A    Male   48
2       3  Decy3    Anshaj   H4Harry@gmail.com  decy2M0#A    Male   54
3       4  Decy4     Harry   S5Deepa@gmail.com  decy2Y8#A  Female   52
4       5  Decy5  Satyajit  A3Shukla@gmail.com  decy3M4#A  Female   30

In [44]:
a=[]#ISBN
b=[]#TITLE
c=[]#YEAR
d=[]#PUBLISHER
e=[]#IMAGE URL
loc="ABCDEFGHIJKLMNOPQRSTUVWXYZ"
loc1="1234567890"
op=['Satyajit','Deepa','Anshaj','Shukla','Tyagi','Ron','Harry','Opert']
for i in range(1,length):
    a.append(i+10000000)
    b.append(random.choice(loc)+random.choice(loc1)+random.choice(loc)+random.choice(loc1)+random.choice(loc)+random.choice(loc1)+random.choice(loc)+random.choice(loc1))
    c.append(numpy.random.randint(1996,2018))
    d.append(random.choice(op))
    e.append(i)

In [45]:
book['isbn']=a
book['title']=b
book['year']=c
book['publisher']=d
book['url']=e

In [46]:
book.head()

       isbn     title  year publisher  url
0  10000001  U0W5M4C1  1999     Opert    1
1  10000002  C4O8G4L7  2001    Anshaj    2
2  10000003  J7S6X9Y7  2015  Satyajit    3
3  10000004  U8Q7A8D1  2004    Shukla    4
4  10000005  U6P9S7X4  2001       Ron    5

In [47]:
user.head()

   userid  uname      name               email   password     sex  age
0       1  Decy1  Satyajit  H4Shukla@gmail.com  decy7G7#A  Others   58
1       2  Decy2    Shukla   X1Harry@gmail.com  decy1N1#A    Male   48
2       3  Decy3    Anshaj   H4Harry@gmail.com  decy2M0#A    Male   54
3       4  Decy4     Harry   S5Deepa@gmail.com  decy2Y8#A  Female   52
4       5  Decy5  Satyajit  A3Shukla@gmail.com  decy3M4#A  Female   30

In [48]:
rating=pd.DataFrame()
uid=user['userid'].tolist()
bid=book['isbn'].tolist()
q=[]
w=[] 
r=[]
for i in range(1,50000):
    q.append(random.choice(uid))
    w.append(random.choice(bid))
    r.append(numpy.random.randint(1,10))

In [49]:
rating['user_id']=q
rating['isbn']=w
rating['rating']=r

In [50]:
rating['isbn'].value_counts().head(4)

10000753    73
10000579    69
10000131    69
10000054    69
Name: isbn, dtype: int64

In [51]:
user.head()

   userid  uname      name               email   password     sex  age
0       1  Decy1  Satyajit  H4Shukla@gmail.com  decy7G7#A  Others   58
1       2  Decy2    Shukla   X1Harry@gmail.com  decy1N1#A    Male   48
2       3  Decy3    Anshaj   H4Harry@gmail.com  decy2M0#A    Male   54
3       4  Decy4     Harry   S5Deepa@gmail.com  decy2Y8#A  Female   52
4       5  Decy5  Satyajit  A3Shukla@gmail.com  decy3M4#A  Female   30

In [52]:
book.head()

       isbn     title  year publisher  url
0  10000001  U0W5M4C1  1999     Opert    1
1  10000002  C4O8G4L7  2001    Anshaj    2
2  10000003  J7S6X9Y7  2015  Satyajit    3
3  10000004  U8Q7A8D1  2004    Shukla    4
4  10000005  U6P9S7X4  2001       Ron    5

In [53]:
book.to_csv('book.csv',index=False)
rating.to_csv('rating.csv',index=False)
user.to_csv('user.csv',index=False)

In [50]:
user.head(2)

   userid  uname    name              email   password   sex  age
0       1  Decy1   Deepa    A4Ron@gmail.com  decy0E3#A  Male   67
1       2  Decy2  Anshaj  C5Opert@gmail.com  decy0K1#A  Male   45

In [51]:
cur.execute('create table user (userid INT PRIMARY KEY AUTO_INCREMENT,uname varchar(100) ,name varchar(100),email varchar(100),password varchar(100),sex varchar(100),age INT)')

0

In [52]:
a=user['userid'].tolist()
b=user['uname'].tolist()
c=user['name'].tolist()
d=user['email'].tolist()
e=user['password'].tolist()
f=user['sex'].tolist()
g=user['age'].tolist()

In [53]:
for i in range(1,len(a)):
    cur.execute('insert into user values("%d","%s","%s","%s","%s","%s","%d")'% (a[i],b[i],c[i],d[i],e[i],f[i],g[i]))

In [54]:
db.commit()

In [55]:
book.head(2)

       isbn     title  year publisher  url
0  10000001  I8T5X2S5  1996    Anshaj    1
1  10000002  R7H7Q6R8  2017     Deepa    2

In [56]:
cur.execute('create table book (isbn INT,title varchar(200),year INT,publisher varchar(100),url varchar(100))')

0

In [57]:
a=book['isbn'].tolist()
b=book['title'].tolist()
c=book['year'].tolist()
d=book['publisher'].tolist()
e=book['url'].tolist()

In [58]:
for i in range(len(a)):
    cur.execute('insert into book values("%d","%s","%d","%s","%s")'% (a[i],b[i],c[i],d[i],e[i]))

In [59]:
db.commit()

In [60]:
rating.head(2)

   user_id      isbn  rating
0       57  10000009       2
1       31  10000142       9

In [54]:
cur.execute('create table rating (user_id INT,isbn INT,rating INT)')

0

In [55]:
a=rating['user_id'].tolist()
b=rating['isbn'].tolist()
c=rating['rating'].tolist()

In [56]:
o=pd.DataFrame([a,b,c])

In [61]:
o=o.T

In [64]:
o.drop_duplicates(subset =[0,1], 
                     keep = False, inplace = True)

In [66]:
a=o[0].tolist()
b=o[1].tolist()
c=o[2].tolist()

In [70]:
for i in range(len(a)):
    cur.execute('insert into rating values("%d","%d","%d")'% (a[i],b[i],c[i]))

In [71]:
db.commit()

In [65]:
x=cur.execute('Select * from user')